{
    "meta": {
        "name": "FG Weather Quotes",
        "style": "depressed-student-dev-memes",
        "language": "de-DE",
        "version": "1.0"
    },
    "categories": {
        "no_data": [
            "Keine Daten. So wie mein Plan fürs Leben.",
            "Wir suchen Daten wie wir Motivation: selten erfolgreich.",
            "Hier wären Daten. Wenn wir welche hätten.",
            "Empty State. Full panic.",
            "Keine Daten gefunden. Genau wie mein Fokus.",
            "Daten: 0. Hoffnung: 1%.",
            "Wir haben nichts gefunden – außer neue Probleme.",
            "Das System ist leer. Mein Kopf auch.",
            "Keine Daten. Aber immerhin konsistent.",
            "Wenn du Daten siehst, sag Bescheid.",
            "No data. Just vibes.",
            "Wir liefern heute: Enttäuschung.",
            "Diese Seite ist so leer wie mein Schlafkonto.",
            "Daten fehlen. Wie Disziplin in der Prüfungsphase.",
            "Der Graph ist leer, aber mein Stress ist voll."
        ],
        "loading": [
            "Lädt… wie ich in der Klausurenphase: gar nicht.",
            "Wir berechnen Durchschnittswerte und Existenzfragen.",
            "Loading… bitte nicht beobachten, dann geht’s schneller.",
            "Lädt seit gestern. Also quasi historisch.",
            "Ich lade Daten wie ich Uni mache: auf den letzten Drücker.",
            "Loading… wir sind noch in der Findungsphase.",
            "Bitte warten. Wir auch.",
            "Lädt… wahrscheinlich weil der Server auch Student ist.",
            "Lädt… und ich gleich auch ab.",
            "Wir holen Daten ab. Emotional leider niemanden.",
            "Loading… ich sehe Licht am Ende des Tunnels (Fehlermeldung).",
            "Lädt… die Wahrscheinlichkeit sinkt jede Sekunde."
        ],
        "api_down": [
            "API down, ich auch.",
            "Server sagt nein. Ich auch.",
            "Unsere API ist so erreichbar wie ich vor 12 Uhr.",
            "API nicht erreichbar – wie meine Deadlines.",
            "Die API hat sich abgemeldet. Verständlich.",
            "503: Service Unavailable. Same.",
            "Die API ist weg. Wie mein Wille zu leben.",
            "Wir funken zur API, aber sie ghostet uns.",
            "Die API ist offline. Ich bin innerlich auch offline.",
            "API down. Trotzdem Abgabe 23:59.",
            "Unsere API hat Burnout.",
            "Wenn’s nicht geht, nennen wir’s MVP."
        ],
        "uni_crisis": [
            "Wir suchen Lösungen wie wir Lernpläne: verzweifelt.",
            "Mein Wochenplan ist stabiler als diese App. Und der ist auch Müll.",
            "Ich studiere nicht. Ich überlebe nur in Credits.",
            "Klausurphase: wo Schlaf ein Mythos ist.",
            "Meine Produktivität ist wie das Wetter: unberechenbar.",
            "Ich hab einen Plan. Der Plan hat nur mich nicht gefragt.",
            "Uni ist wie ein Sprint, aber ohne Ziel und mit Schmerzen.",
            "Wenn Stress eine Note wäre: 1,0.",
            "Ich lerne effizient: 5 Stunden Panik, 10 Minuten Stoff.",
            "Heute mache ich alles. Morgen auch. Irgendwann nie.",
            "Diese App hat mehr Struktur als mein Leben.",
            "Ich bin nicht überfordert. Ich bin nur datengetrieben panisch.",
            "Klausurphase ist einfach nur ein langen Loading Screen.",
            "Ich wollte nur kurz studieren. Jetzt studiert das Trauma mich.",
            "Das ist kein Studium. Das ist ein Bossfight."
        ],
        "party_kater": [
            "Gestern Party. Heute Durchschnittstemperaturen.",
            "Kater-Level: historisch signifikant.",
            "Ich bin heute nur ein Mittelwert aus Müdigkeit und Kaffee.",
            "Mein Kreislauf ist instabiler als unsere API.",
            "Es war eine gute Idee zu feiern. Bis heute.",
            "Ich bin nicht müde. Ich bin im Energiesparmodus.",
            "Mein Kopf macht 404.",
            "Hydration fehlt. Genau wie Daten.",
            "Average student life: 30% Uni, 70% Schaden.",
            "Ich hab nichts verstanden, aber es fühlt sich nach Fortschritt an.",
            "Klausurphase + Kater = wissenschaftlich nicht empfohlen.",
            "Der einzige konstante Wert in meinem Leben ist der Kater."
        ],
        "debugging": [
            "Wir debuggen Wetterdaten und unsere Entscheidungen.",
            "Das ist kein Bug. Das ist character development.",
            "Wenn’s klappt, war’s Absicht.",
            "Ich fix den Fehler gleich. Genau wie mein Leben.",
            "Wir haben ein Problem gefunden. Und neue Freunde: 12 weitere.",
            "Dieser Bug ist so alt, er zählt als historisch.",
            "Es funktioniert auf meinem Mac. Also Problem gelöst.",
            "Ich hab’s gefixt. Bitte nie wieder anfassen.",
            "Die Lösung ist einfach. Ich verstehe sie nur nicht.",
            "Unsere Logs erzählen Geschichten. Tragische.",
            "Ich hasse diesen Fehler. Er kennt mich inzwischen persönlich.",
            "Der Code läuft. Aber zu welchem Preis?"
        ],
        "stats_nerd": [
            "Durchschnitt ist auch ein Gefühl.",
            "Im Mittel bin ich okay. Einzelwerte sprechen dagegen.",
            "Varianz? Ja, in meiner Stimmung.",
            "Standardabweichung: mein Charakter.",
            "Unsere Ergebnisse sind signifikant. Der Stress auch.",
            "p-Wert klein, Probleme groß.",
            "Wir glätten Kurven, aber nicht unsere Existenzängste.",
            "Confidence Interval: irgendwo zwischen Hoffnung und Panik.",
            "Regression läuft. Leben nicht.",
            "Die Daten lügen nicht. Ich schon (zu mir selbst).",
            "Statistik: Die Kunst, Chaos mathematisch hübsch zu machen.",
            "Wir suchen Muster wie wir Sinn: lange."
        ]
    }
}